espressif/esp-idf/components/esp_adc/test_apps/adc/sdkconfig.ci.esp32c2_xtal26m_release
CONFIG_IDF_TARGET="esp32c2"
CONFIG_XTAL_FREQ_26=y

CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
